{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "ไง",
        "สวัสดี"
      ],
      "responses": [
        "ไงง :-)",
        "สวัสดีครับ, ขอบคุณสําหรับการเยี่ยมชม",
        "สวัสดี, ฉันจะทําอะไรให้คุณได้บ้าง",
        "สวัสดี, ฉันจะช่วยได้อย่างไร"
      ]
    },
    {
      "tag": "goodbye",
      "patterns": ["บาย", "ไว้เจอกัน", "ลาก่อน"],
      "responses": [
        "แล้วพบกันใหม่, ขอบคุณสําหรับการเยี่ยมชม",
        "ขอให้มีความสุข",
        "ลาก่อน! กลับมาอีกครั้งเร็ว ๆ นี้"
      ]
    },
    {
      "tag": "thanks",
      "patterns": ["ขอบคุณ", "ขอบคุณมาก", "มันช่วยได้มากเลย"],
      "responses": ["ยินดีที่จะช่วย!", "ทุกเวลา!", "ด้วยความยินดี"]
    },
    {
      "tag": "FirstQ",
      "patterns": [
        "ควรเปลี่ยนน้ำมันเครื่องตอนไหน"

      ],
      "responses": [
        "การเปลี่ยนน้ำมันเครื่องควรที่จะเปลี่ยนทุกๆ8,000กิโลเมตร ไม่เกิน 10,000 กิโลเมตรหรือทำการเปลี่ยนทุก ๆ 4เดือน ซึ่งก็ขึ้นอยู่กับประสิทธิภาพของน้ำมันเครื่องสังเคราะห์แต่ละรูปแบบ"

      ]
    },
    {
      "tag": "SecQ",
      "patterns": [
        "ควรเปลี่ยนน้ำมันเกียร์ตอนไหน"
      ],
      "responses": [
         "การเปลี่ยนน้ำมันเครื่องควรที่จะเปลี่ยนทุกๆ50,000กิโลเมตร หรือ 100,000 กิโลเมตร ซึ่งก็ขึ้นอยู่กับประสิทธิภาพของน้ำมันนกียร์ที่ใช้อยู่"
      ]
    },
    {
      "tag": "ThirQ",
      "patterns": [
        "ควรเปลี่ยนน้ำยาหล่อเย็น น้ำหม้อน้ำ ตอนไหนควรเปลี่ยนน้ำยาหล่อเย็น น้ำหม้อน้ำ ตอนไหน"
      ],
      "responses": [
        "เปลี่ยนเมื่อรถวิ่งเป็นระยะทาง 40,000-160,000 กม. หรือเปลี่ยนปีละครั้ง ทั้งนี้ ขึ้นอยู่กับคุณภาพของน้ำยาหล่อเย็น"
      ]
    },
    {
      "tag": "Qq",
      "patterns": [
        "รถสตาร์ทไม่ติดเกิดจากอะไร"

      ],
      "responses": [
        "ถ้าบีบแตรแล้วไม่มีเสียงออกมาอาจเกิดจากแบตเตอรี่หมด ถ้าบีบแตรแล้วมีเสียงอยู่แนะนำให้โทรเรียกศูนย์บริการเพื่อนำรถไปตรวจเช็คต่อไป"
      ]
    },
    {
      "tag": "FifQ",
      "patterns": [
        "ควรเปลี่ยนน้ำมันเบรกเมื่อไร "

      ],
      "responses": [
        "ควรเปลี่ยนทุก ๆ 1-2 ปี หรือทุกระยะทาง 40,000 กม. เพื่อให้น้ำมันเบรกสามารถทำงานได้อย่างมีประสิทธิภาพมากที่สุด"
      ]
    },
    {
      "tag": "SixQ",
      "patterns": [
        "เบรกไม่อยู่ เบรกไหล เบรกวืด เกิดจากอะไร"

      ],
      "responses": [
        "อาจเกิดจากน้ำมันเบรกเสื่อมอายุการใช้งานและประสิทธิภาพที่ลดน้อยลงกลายเป็นสีที่เริ่มคล้ำ ควรนำรถเข้าศูนย์เพื่อเปลี่ยนน้ำมันเบรกที่ดีกว่าเดิม"
      ]
    },
     {
      "tag": "SevenQ",
      "patterns": [
        "ควรนำรถเข้าเช็คระยะทุกๆกี่กิโล"

      ],
      "responses": [
        "ควรนำรถเข้าเช็คระยะที่ศูนย์บริการทุกๆ10,000กิโลเพื่อตรวจเช็คความสมบูรณ์ของรถท่าน"
      ]
    }
  ]
}
